ExchangePlans/EUF_ПроводникВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<ExchangePlan>
		<Properties>
			<Name>EUF_ПроводникВнешниеСистемы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбменВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательСоединения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникПодключенияКВнешнимСистемам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяРеглЗаданий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРеглЗаданияПодготовкаИсходящих</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРеглЗаданияОтправкаИсходящих</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРеглЗаданияОбработкаВходящих</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРеглЗаданияУдалениеСообщений</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХраненияСообщенийВДнях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхИсходящихБезОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхИсходящихСОшибками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыгружаемыхИсходящихБезОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВыгружаемыхИсходящихСОшибками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхВходящихБезОшибок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОбрабатываемыхВходящихСОшибками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУдаляемыхСообщений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/EUF_ПроводникВнешниеСистемы/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	Если ПометкаУдаления Тогда
		ОбменВключен = Ложь;
	КонецЕсли;
	
	Если КоличествоУдаляемыхСообщений = 0 Тогда
		КоличествоУдаляемыхСообщений = 1;
	КонецЕсли;
	
	МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.EUF_ПроводникПодготовкаИсходящих;	
	ПодготовитьРеглЗадания(ИДРеглЗаданияПодготовкаИсходящих, МетаданныеРеглЗадания,
							"Подготовка исходящих", "РасписаниеПодготовкаИсходящихНовое");
	
	МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.EUF_ПроводникОтправкаИсходящих;	
	ПодготовитьРеглЗадания(ИДРеглЗаданияОтправкаИсходящих, МетаданныеРеглЗадания,
							"Отправка исходящих", "РасписаниеОтправкаИсходящихНовое");
	
	Если Не ЭтотУзел Тогда
		МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.EUF_ПроводникОбработкаВходящих;	
		ПодготовитьРеглЗадания(ИДРеглЗаданияОбработкаВходящих, МетаданныеРеглЗадания,
							"Обработка входящих", "РасписаниеОбработкаВходящихНовое");
		
		МетаданныеРеглЗадания = Метаданные.РегламентныеЗадания.EUF_ПроводникУдалениеНеактуальныхДанных;	
		ПодготовитьРеглЗадания(ИДРеглЗаданияУдалениеСообщений, МетаданныеРеглЗадания,
							"Удаление сообщений", "РасписаниеУдалениеНеактуальныхСообщенийНовое");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры	

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбменВключен Тогда
		ВключитьРеглЗадание(ИДРеглЗаданияПодготовкаИсходящих, "РасписаниеПодготовкаИсходящихВключено");
		ВключитьРеглЗадание(ИДРеглЗаданияОтправкаИсходящих, "РасписаниеОтправкаИсходящихВключено");
		Если Не ЭтотУзел Тогда
			ВключитьРеглЗадание(ИДРеглЗаданияОбработкаВходящих, "РасписаниеОбработкаВходящихВключено");
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЭтотУзел Тогда
		ВключитьРеглЗадание(ИДРеглЗаданияУдалениеСообщений, "РасписаниеУдалениеНеактуальныхСообщенийВключено");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПодготовитьРеглЗадания(ИДРеглЗадания, МетаданныеРеглЗадания, ИмяДействияРеглЗадания, ИмяНовогоРасписания)
	
	Если ОбменВключен И ДополнительныеСвойства.Свойство(ИмяНовогоРасписания) Тогда		
		
		Если Не ЗначениеЗаполнено(ИДРеглЗадания) Тогда
			РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеРеглЗадания);
		Иначе
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
			Если РегламентноеЗадание = Неопределено Тогда
				РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданныеРеглЗадания);
			КонецЕсли;
		КонецЕсли;
		РегламентноеЗадание.Наименование = СтрШаблон("(QIWI Адаптер) Внешняя система %1 %2", Код, ИмяДействияРеглЗадания);
		РегламентноеЗадание.ИмяПользователя = ИмяПользователяРеглЗаданий;
		РегламентноеЗадание.Использование = Ложь;
		РегламентноеЗадание.Записать();
		ИДРеглЗадания = РегламентноеЗадание.УникальныйИдентификатор;
		
	Иначе
		Если ЗначениеЗаполнено(ИДРеглЗадания) Тогда
			РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
			Если РегламентноеЗадание <> Неопределено Тогда
				РегламентноеЗадание.Использование = Ложь;
				РегламентноеЗадание.Записать();				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство(ИмяНовогоРасписания) И ЗначениеЗаполнено(ИДРеглЗадания) Тогда
		РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
		Если РегламентноеЗадание <> Неопределено Тогда
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ДополнительныеСвойства[ИмяНовогоРасписания]);
			Расписание = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON, Тип("РасписаниеРегламентногоЗадания"));
			РегламентноеЗадание.Расписание = Расписание;
			РегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

Процедура ВключитьРеглЗадание(ИДРеглЗадания, ИмяРеквизитаРасписаниеВключено)
	
	Если Не ДополнительныеСвойства.Свойство(ИмяРеквизитаРасписаниеВключено) Тогда
		РасписаниеВключено = Ложь;
	Иначе
		РасписаниеВключено = ДополнительныеСвойства[ИмяРеквизитаРасписаниеВключено];
	КонецЕсли;
	
	РегламентноеЗадание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИДРеглЗадания);
	Если РегламентноеЗадание <> Неопределено Тогда
		
		РасписаниеВключено = ДополнительныеСвойства[ИмяРеквизитаРасписаниеВключено];
		РегламентноеЗадание.Использование = РасписаниеВключено;
		РегламентноеЗадание.Параметры.Очистить();
		РегламентноеЗадание.Параметры.Добавить(Ссылка);
		РегламентноеЗадание.Параметры.Добавить(ИДРеглЗадания);
		РегламентноеЗадание.Записать();
	КонецЕсли;
		
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
